# Binaries
brew 'zsh' # zsh (latest)
brew 'wget' # file downloader
brew 'htop' # a colorful top alternative
brew 'httpie' # http client
brew 'jq' # work with JSON files in shell scripts
brew 'diff-so-fancy' # good-looking diffs
brew 'git-absorb' # absorb staged changes in current branch
brew 'stow' # symlink manager
brew 'tldr' # better than help
brew 'bat' # better cat
brew 'fzf' # fuzzy file searcher, used in scripts and in vim
brew 'eza' # ls alternative
brew 'tree' # pretty-print directory contents
brew 'vim' # vim (latest)
brew 'watch' # execute a program periodically
brew 'z' # switch between most used directories
brew 'git' # git version control (latest version)
brew 'gnupg' # tool for managing pgp keys
brew 'pinentry-mac' # tool that allow GnuPG to read passphrases
brew 'rust' # rust (latest)

# Apps
cask 'obsidian'
cask 'spotify'
cask 'docker'

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-cascadia-code'
cask 'font-commit-mono'
cask 'font-commit-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
