# Binaries
brew 'zsh' # zsh (latest)
brew 'wget' # file downloader
brew 'htop' # a colorful top alternative
brew 'httpie' # http client
brew 'jq' # work with JSON files in shell scripts
brew 'jless' # cli JSON viewer
brew 'diff-so-fancy' # good-looking diffs
brew 'git-absorb' # absorb staged changes in current branch
brew 'stow' # symlink manager
brew 'tldr' # better than help
brew 'bat' # better cat
brew 'bat-extras' # various cli tools integrate with bat
brew 'fzf' # fuzzy file searcher, used in scripts and in vim
brew 'fd' # fast find
brew 'eza' # ls alternative
brew 'tree' # pretty-print directory contents
brew 'vim' # vim (latest)
brew 'watch' # execute a program periodically
brew 'zoxide' # switch between most used directories
brew 'git' # git version control (latest version)
brew 'gnupg' # tool for managing pgp keys
brew 'pinentry-mac' # tool that allow GnuPG to read passphrases
brew 'rust' # rust (latest)
brew 'pyenv' # tool for Python version management
brew 'pyenv-virtualenv' # pyenv plugin to manage virtualenv
brew 'neofetch' # system info script
brew 'tmux' # terminal multiplexer
brew 'lazygit' # TUI for git commands
brew 'ripgrep' # fast grep
brew 'asciinema' # terminal session recorder

# Apps
cask 'obsidian'
cask 'spotify'
cask 'docker'
cask 'beyond-compare' # compare files and folders in nice UI
cask 'sublime-text' # best text editor
cask 'iterm2'
cask 'raycast'

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-cascadia-code'
cask 'font-commit-mono'
cask 'font-commit-mono-nerd-font'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
