# Binaries
brew 'zsh'
brew 'wget'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'diff-so-fancy'
brew 'git-absorb'
brew 'stow'
brew 'tldr'
brew 'bat'
brew 'fzf'
brew 'eza'
brew 'tree'

# Apps
cask 'obsidian'
cask 'spotify'
cask 'docker'

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-cascadia-code'
cask 'font-commit-mono'
cask 'font-commit-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
